<template>
	<MyPromo v-if="props.showPromo">Конкурс для будующих IT специалистов</MyPromo>
    <div class="container">
        <div class="about-us">
            <h2 class="title">О нас</h2>
            <p class="about-us__text">
                Программа поддержки проектных команд и студенческих инициатив для формирования инновационных продуктов федерального государственного образовательного учреждения высшего образования «Бурятский государственный университет им. Доржи Банзарова» представлена в составе заявки на участие в отборе образовательных организаций высшего образования в рамках реализации Акселерационных программ проекта «Платформа университетского технологического предпринимательства» государственной программы Российской Федерации «Научно-технологическое развитие Российской Федерации».
            </p>
            <p class="about-us__text">
                Акселерационная программа направлена на содействие увеличению вклада федерального государственного образовательного учреждения высшего образования «Бурятский государственный университет им. Доржи Банзарова»в достижение национальных целей развития Российской Федерации на период до 2035 года, сбалансированное пространственное развитие страны, обеспечение доступности качественного высшего образования в субъектах Российской Федерации, развитие стартап-проектов проектных команд и студенческих инициатив в целях формирования инновационных продуктов и вовлечения проектных программ в технологическое предпринимательство по одному/или нескольким из технологических направлений, определенных с учетом приоритетных направлений развития науки, технологий и техники, развития компетенций этих проектных команд, доработки технологического решения и бизнес-модели, поиска и привлечения инвесторов и новых потребителей, масштабирования бизнеса, увеличения прибыли и (или) выручки в рамках реализации проекта «Платформа университетского технологического предпринимательства» государственной программы Российской Федерации «Научно-технологическое развитие Российской Федерации».
            </p>
            <router-link to="/about" class="btn btn-success btn-md text-white mt-5">Больше информации</router-link>
        </div>
    </div>
	<ProjectList :count="3" :betting="false" />
</template>

<script setup>
    import MyPromo from './MyPromo.vue';
    import ProjectList from './ProjectList.vue';

    const props = defineProps({
        showPromo: Boolean
    })
</script>

<style>
    .about-us {
        width: 100%;
        margin-top: 42px;
        text-align: center;
    }

    .about-us__text {
        font-size: 1rem;
        color: #222;
        margin-top: 12px;
    }
</style>